[
  {
    "category": "Health Conditions",
    "articles": [
      {
        "title": "Hypertension",
        "content": "High blood pressure, or hypertension, means the force of blood in your arteries is too high. It’s called the \"silent killer\" because it often has no symptoms. It can lead to serious problems like heart attack or stroke. Risk factors include stress, unhealthy eating, lack of exercise, smoking, and family history.\n\nTo treat high blood pressure, doctors may give you medicine. These medicines help relax blood vessels or lower fluid in your body. Checking your blood pressure at home is important. You should visit your doctor regularly to stay healthy.\n\nTo prevent high blood pressure, eat healthy foods. Choose less salt and more fruits and vegetables. Exercise regularly, like walking for 30 minutes most days. Keep a healthy weight to ease your heart’s work. Avoid smoking and limit alcohol. Manage stress with relaxation or deep breathing. Get your blood pressure checked every year.\n\nHypertension can be controlled with simple steps. Medicines and lifestyle changes work together. Talk to your doctor for a plan that suits you."
      },
      {
        "title": "Diabetes",
        "content": "Diabetes is a condition where the body cannot control blood sugar well. It happens when the body lacks insulin (Type 1) or cannot use it properly (Type 2). Symptoms include feeling very thirsty, urinating often, tiredness, and slow-healing cuts. If not managed, it can cause kidney problems, nerve damage, or blindness. Risk factors include unhealthy eating, lack of exercise, obesity, and family history.\n\nTo treat diabetes, doctors may prescribe medicines or insulin shots. These help keep blood sugar levels normal. Checking blood sugar daily with a glucometer is important. Eating a balanced diet with less sugar and carbs helps. Regular doctor visits ensure the treatment works.\n\nTo prevent diabetes, eat healthy foods like vegetables and whole grains. Avoid sugary drinks and snacks. Exercise for 30 minutes most days, like walking or cycling. Keep a healthy weight to reduce strain on your body. Get blood sugar tested yearly, especially if diabetes runs in your family.\n\nDiabetes can be managed with simple changes. Medicines, diet, and exercise work together. Talk to your doctor for a plan that fits you."
      },
      {
        "title": "Asthma",
        "content": "Asthma is a lung condition that makes breathing hard. It causes swelling and tightening of the airways. Symptoms include wheezing, shortness of breath, and coughing. Triggers like pollen, dust, exercise, or cold air can start symptoms. If not controlled, asthma attacks can be dangerous and need emergency care. Risk factors include allergies, smoking, air pollution, and family history.\n\nTo treat asthma, doctors prescribe inhalers. Quick-relief inhalers open airways during attacks. Daily inhalers reduce swelling in the lungs. Using inhalers correctly is important. Visiting the doctor regularly helps adjust the treatment plan. During severe attacks, get emergency help right away.\n\nTo prevent asthma problems, avoid triggers. Stay away from dust, pet fur, and smoke. Use an air purifier at home. Exercise gently to stay healthy without triggering symptoms. Cover your mouth in cold weather to warm the air. Get a yearly check-up to monitor your lungs.\n\nAsthma cannot be cured but can be managed. Inhalers and avoiding triggers keep it under control. Talk to your doctor for a plan that works for you."
      },
      {
        "title": "Arthritis",
        "content": "Arthritis is a condition that causes swollen and painful joints. The most common types are osteoarthritis and rheumatoid arthritis. Osteoarthritis comes from joint wear and tear. Rheumatoid arthritis happens when the body attacks its own joints. Symptoms include joint pain, stiffness, and swelling. These often get worse as people age. Risk factors include aging, obesity, injuries, and family history.\n\nTo treat arthritis, doctors may prescribe pain medicines. Medicines like ibuprofen reduce pain and swelling. Physical therapy helps joints move better. Doing gentle exercises improves strength around joints. In severe cases, surgery like joint replacement may be needed. Regular doctor visits help manage symptoms.\n\nTo prevent arthritis problems, stay active. Low-impact exercises like swimming keep joints flexible. Maintain a healthy weight to reduce stress on joints. Eat foods rich in fruits, vegetables, and fish. Avoid repetitive joint strain from heavy lifting. Get regular check-ups to catch problems early.\n\nArthritis can be managed with simple steps. Medicines, exercise, and healthy habits help. Talk to your doctor for a plan that suits you."
      }
    ]
  },
  {
    "category": "Injuries",
    "articles": [
      {
        "title": "Fractures",
        "content": "A fracture is a broken bone. It happens from strong force like falls or accidents. Symptoms include sharp pain, swelling, and trouble moving the area. Some fractures are simple with a clean break. Others are compound where the bone breaks the skin. Risk factors include weak bones, sports, and risky activities.\n\nTo treat a fracture, doctors use casts to hold the bone still. This helps the bone heal properly. For serious fractures, surgery with pins or plates may be needed. Resting the injured area is important. Physical therapy after healing strengthens the bone. Regular doctor visits check the healing process.\n\nTo prevent fractures, keep bones strong. Eat foods with calcium like milk and leafy greens. Exercise regularly to build bone strength. Use protective gear during sports. Avoid falls by keeping floors clear. Get bone health checked if you’re over 50.\n\nFractures can heal with proper care. Casts, rest, and strong bones help. Talk to your doctor for advice."
      },
      {
        "title": "Burns",
        "content": "Burns are skin injuries from heat, electricity, chemicals, or radiation. They can be mild or very serious. First-degree burns are shallow like sunburns. Second-degree burns cause blisters. Third-degree burns damage deep skin layers. Risk factors include cooking accidents, unsafe electrical use, and chemical exposure.\n\nTo treat burns, cool the area with running water for 10 minutes. Cover the burn lightly with a clean cloth. Do not pop blisters or use ice. For severe burns, get medical help quickly. Doctors may use special creams to prevent infection. Regular check-ups ensure proper healing.\n\nTo prevent burns, be careful in the kitchen. Keep hot items away from edges. Use gloves when handling chemicals. Check electrical cords for damage. Install smoke alarms in your home. Learn first aid for burns.\n\nBurns can heal with quick action. Cooling and medical care help. Talk to your doctor for guidance."
      },
      {
        "title": "Sprains and Strains",
        "content": "Sprains and strains are injuries to ligaments or muscles. Sprains happen when ligaments stretch or tear, like a twisted ankle. Strains affect muscles or tendons, like a pulled hamstring. Symptoms include pain, swelling, and trouble moving. Risk factors include sports, uneven surfaces, and weak muscles.\n\nTo treat sprains and strains, use the RICE method. Rest the injured area to avoid more damage. Apply ice to reduce swelling. Use a bandage for compression. Elevate the injury above your heart. For severe cases, physical therapy helps recovery. Surgery may be needed for bad tears. See a doctor to check healing.\n\nTo prevent sprains and strains, warm up before exercise. Wear proper shoes for support. Strengthen muscles with regular workouts. Avoid uneven ground when running. Stretch daily to stay flexible. Learn safe ways to lift heavy items.\n\nSprains and strains can heal with care. RICE and exercise help. Talk to your doctor for advice."
      }
    ]
  },
  {
    "category": "Emergency Procedures",
    "articles": [
      {
        "title": "CPR",
        "content": "Cardiopulmonary Resuscitation, or CPR, saves lives when someone’s heart stops. It is used during cardiac arrest to restart breathing and heartbeat. CPR involves pressing hard on the chest. If trained, you can also give rescue breaths. Risk factors for needing CPR include heart disease, smoking, and obesity.\n\nTo perform CPR, check if the person responds. If they don’t, call emergency services right away. Start chest compressions in the center of the chest. Push down 2 inches deep, 100 to 120 times per minute. Keep going until help arrives. Use an AED if available and follow its instructions. Take a CPR training course to learn properly. Practice regularly to stay confident.\n\nTo prevent the need for CPR, eat healthy foods. Choose fruits, vegetables, and whole grains. Exercise 30 minutes most days to keep your heart strong. Quit smoking to protect your heart. Manage stress with deep breathing or relaxation. Get heart health check-ups every year.\n\nCPR can save someone’s life. Learn it and stay healthy. Talk to your doctor for heart advice."
      },
      {
        "title": "Choking",
        "content": "Choking occurs when an object, like food, blocks the airway. It stops air from reaching the lungs. Signs include holding the throat, not talking, and turning blue. Fast action is needed to clear the blockage. Risk factors include eating quickly, large bites, and small items for kids.\n\nTo treat choking, perform the Heimlich maneuver. Stand behind the person and place your arms around them. Put a fist just above their belly button. Push hard inward and upward to remove the object. Repeat until the person breathes again. If it fails, call emergency services quickly. Learn the Heimlich maneuver in a first aid class.\n\nTo prevent choking, eat slowly and chew well. Cut food into small pieces for children. Keep tiny toys away from young kids. Eat while sitting straight, not lying down. Don’t talk or laugh with food in your mouth. Take a choking first aid course.\n\nChoking can be stopped with quick help. The Heimlich maneuver and careful habits work. Talk to a doctor for more tips."
      },
      {
        "title": "Bleeding Control",
        "content": "Severe bleeding is when blood flows heavily from a wound. It can cause shock or death if not stopped fast. Signs include bright red spurting or soaking through cloths. Quick action is needed to save a life. Risk factors include sharp tools, accidents, and unsafe activities.\n\nTo treat severe bleeding, press hard on the wound. Use a clean cloth or your hands to stop the blood. Raise the wound above the heart if you can. Keep pressing until the bleeding slows. Use a tourniquet only if trained and bleeding won’t stop. Call emergency services for deep or spurting wounds. Take a first aid course to learn bleeding control.\n\nTo prevent severe bleeding, handle sharp objects carefully. Store knives and tools safely. Wear gloves when working with machines. Use safety gear during sports or outdoor tasks. Keep floors clear to avoid falls. Learn first aid for emergencies.\n\nSevere bleeding can be stopped with quick action. Pressure and safety habits help. Talk to a doctor for more tips."
      }
    ]
  },
  {
    "category": "Mental Health",
    "articles": [
      {
        "title": "Anxiety",
        "content": "Anxiety disorders cause too much worry or fear. They make daily life hard. Symptoms include feeling restless, fast heartbeat, and trouble focusing. Triggers like stress or bad experiences can start it. Risk factors include family history, trauma, and high stress.\n\nTo treat anxiety, talking to a therapist helps. Therapy teaches ways to handle worry. Doctors may give medicines to calm the mind. Practicing deep breathing or relaxation works well. Regular therapy sessions keep anxiety under control. Joining a support group can also help.\n\nTo prevent anxiety, exercise every day. Walking or yoga can lower stress. Get enough sleep each night. Eat healthy foods like fruits and vegetables. Talk about worries with a friend. Learn relaxation skills in a class.\n\nAnxiety can be managed with help. Therapy and healthy habits work. Talk to a doctor for a plan."
      },
      {
        "title": "Depression",
        "content": "Depression is a mood disorder causing persistent sadness, hopelessness, and loss of interest in activities. Physical signs include fatigue, appetite changes, and sleep issues. It’s linked to chemical imbalances, genetics, or life events.\nTo treat depression, therapy, like cognitive behavioral therapy, helps. It teaches coping skills. Doctors might prescribe antidepressants to balance brain chemicals. Building a strong social support network is important. Establishing a consistent daily routine can also be beneficial.\nTo prevent depression, aim for regular physical activity. Exercise can boost mood. Prioritize getting adequate sleep each night. Maintain a balanced diet with nutritious foods. Stay connected with friends and family. Learn and practice stress management techniques.\nDepression can be managed effectively with the right support and strategies. Therapy, medication, and healthy lifestyle choices are key. Consulting a healthcare professional is the first step towards a personalized plan."
      }
    ]
  },
  {
    "category": "Infectious Diseases",
    "articles": [
      {
        "title": "Influenza",
        "content": "Influenza (flu) is a contagious viral infection causing fever, body aches, cough, and fatigue. It spreads through droplets from coughing or sneezing.\nTo treat the flu, rest and drink plenty of fluids to stay hydrated. Over-the-counter medications can help manage symptoms like fever and aches. Antiviral drugs, such as Tamiflu, may be prescribed by a doctor, especially for those at higher risk.\nTo prevent the flu, getting an annual flu vaccination is the most effective measure. Practice good hygiene, like frequent handwashing and covering coughs and sneezes. Avoid close contact with people who are sick.\nInfluenza is generally manageable with supportive care and prevention. However, complications like pneumonia can occur, particularly in the elderly or those with weakened immune systems. Seek medical advice if symptoms worsen or if you are in a high-risk group."
      },
      {
        "title": "COVID-19",
        "content": "COVID-19, caused by the SARS-CoV-2 virus, ranges from mild respiratory symptoms (cough, fever) to severe pneumonia. Spread occurs via droplets or contact.\nTo treat COVID-19, management depends on the severity. Mild cases often require rest, fluids, and symptom relief at home. More severe cases may necessitate hospitalization for oxygen therapy or antiviral medications. Monoclonal antibody treatments may also be used in certain situations.\nTo prevent COVID-19, vaccination is a primary tool. Wearing masks in public indoor settings and practicing frequent hand hygiene (washing with soap and water or using hand sanitizer) are also effective. Maintaining physical distance from others can help reduce transmission.\nCOVID-19 outcomes vary widely. While many experience mild illness, severe disease and complications can occur, especially in vulnerable populations. Following public health guidelines and seeking medical care when needed are crucial."
      }
    ]
  }
]